# üéì Examen Final: SQL y Gesti√≥n de Datos (15 Puntos)

**Contexto:** Eres el Data Steward de la **Universidad Santo Tom√°s**. Se acerca el cierre de semestre y la decanatura requiere una gesti√≥n intensiva de la base de datos: desde registrar ofertas de √∫ltima hora hasta generar los indicadores finales de deserci√≥n y carga acad√©mica.

**Instrucciones:**
* Aseg√∫rate de tener el archivo **`universidad.db`** en esta misma carpeta.
* Cada punto tiene un valor de **1.0** sobre 15.
* Usa `conn.commit()` despu√©s de las sentencias de modificaci√≥n (INSERT/UPDATE/DELETE).
* Usa `pd.read_sql_query` para las consultas de selecci√≥n (SELECT).

---

In [1]:
# üõ†Ô∏è CONFIGURACI√ìN INICIAL
import sqlite3
import pandas as pd
import os

db_filename = '../DataSet/universidad.db'

if not os.path.exists(db_filename):
    print(f"‚ö†Ô∏è ERROR: No encuentro '{db_filename}'. S√∫belo a esta carpeta.")
else:
    conn = sqlite3.connect(db_filename)
    cursor = conn.cursor()
    cursor.execute("PRAGMA foreign_keys = ON;")
    print(f"‚úÖ Conectado a '{db_filename}'. ¬°Listo para el examen!")

‚úÖ Conectado a '../DataSet/universidad.db'. ¬°Listo para el examen!

## üìù Secci√≥n 1: Gesti√≥n Acad√©mica (DML) - 5 Puntos

**1. Apertura de Curso (INSERT)**
La facultad abre un nuevo curso electivo.
* Inserta en la tabla `Cursos`:
    * Nombre: **'Big Data & AI'**
    * Cr√©ditos: **5**
    * ID Profesor: **20**

**2. Nuevo Ingreso (INSERT)**
Registra a un nuevo estudiante en la tabla `Estudiantes`:
    * Nombre: **'Lionel'**
    * Apellido: **'Messi'**
    * Email: **'lio@usta.edu.co'**
    * Fecha Ingreso: '2024-11-25'

**3. Matr√≠cula Manual (INSERT)**
Matricula al estudiante 'Lionel Messi' en el curso de 'Big Data & AI' que acabas de crear.
* *Pista:* Necesitar√°s averiguar primero qu√© ID le asign√≥ la base de datos a Lionel y al curso.
* Nota final: `NULL`.

**4. Correcci√≥n de Cr√©ditos (UPDATE)**
El comit√© curricular decidi√≥ que 5 cr√©ditos es demasiado.
* Actualiza el curso 'Big Data & AI' para que tenga **3 cr√©ditos**.

**5. Retiro Definitivo (DELETE)**
El estudiante con **ID = 10** se retira de la universidad.
* Elimina todos sus registros de la tabla `Inscripciones` (para mantener la integridad, primero borramos sus clases).

pruebas

In [36]:
# df_00 = pd.read_sql_query(" SELECT 1 FROM Inscripciones WHERE id_estudiante=501 AND id_curso=101", conn)
# display(df_00)
# df_11 = pd.read_sql_query("SELECT count(1) FROM Cursos", conn)
# display(df_11)

In [ ]:
# Espacio para C√≥digo DML (Recuerda hacer commit)

# 1. Inserta en la tabla `Cursos`:
#       SE NSERTAE SOLO SI NO EXISTE YA ESA INSCRIPCI√ìN
curso_bigdata = 'Big Data & AI'
nuevo_curso = f"""
INSERT INTO Cursos (nombre_curso, creditos, id_profesor)
SELECT '{curso_bigdata}', 5, 20
WHERE NOT EXISTS (
    SELECT 1 FROM Cursos WHERE nombre_curso = '{curso_bigdata}'
);
"""
try:
    cursor = conn.cursor()
    cursor.execute(nuevo_curso)
    conn.commit()
    print("1) Nuevo curso insertado correctamente.")
except sqlite3.OperationalError as e:
    print(f"Error al insertar el nuevo curso: {e}")
    

# 2. Registra a un nuevo estudiante en la tabla `Estudiantes`:
#       SE NSERTAE SOLO SI NO EXISTE YA ESA INSCRIPCI√ìN
nuevo_Estudiante = """ 
                     Insert into Estudiantes (nombre, apellido, email, fecha_ingreso) 
                     SELECT 'Lionel', 'Messi','lio@usta.edu.co','2024-11-25'
                     WHERE NOT EXISTS (
                     SELECT 1 FROM Estudiantes WHERE nombre = 'Lionel' AND apellido='Messi' AND email='lio@usta.edu.co'
                     );
                    """
try:
    cursor = conn.cursor()
    cursor.execute(nuevo_Estudiante)
    conn.commit()
    print("2) Nuevo Estudiante insertado correctamente.")
except sqlite3.OperationalError as e:
    print(f"Error al insertar el nuevo Estudiante: {e}")

# 3. Matricula al estudiante 'Lionel Messi' en el curso de 'Big Data & AI'
#       SE NSERTAE SOLO SI NO EXISTE YA ESA INSCRIPCI√ìN
nuevo_Inscripciones = """
                        Insert into Inscripciones (id_estudiante,id_curso,fecha_inscripcion) 
                        SELECT 501,101,'2025-11-26'
                        WHERE NOT EXISTS (SELECT 1 FROM Inscripciones WHERE id_estudiante=501 AND id_curso=101)
                        """
try:
    cursor = conn.cursor()
    cursor.execute(nuevo_Inscripciones)
    conn.commit()
    print("3) Estudiante inscrito correctamente.")
except sqlite3.OperationalError as e:
    print(f"Error al insertar nueva matricula del Estudiante: {e}")

# 4. El comit√© curricular decidi√≥ que 5 cr√©ditos es demasiado.
update_credito = "Update Cursos set creditos = 4 where nombre_curso = 'Big Data & AI';"
try:
    cursor = conn.cursor()
    cursor.execute(update_credito)
    conn.commit()
    print("4) El curso se le actualizo el numero de creditos correctamente.")
except sqlite3.OperationalError as e:
    print(f"Error actualizar el numero de creditos del curso: {e}")

# 5. El estudiante con **ID = 10** se retira de la universidad.
delete_Inscripciones = "DELETE FROM Inscripciones WHERE id_estudiante = 10;"
delete_estudiante = "DELETE FROM Estudiantes WHERE id_estudiante = 10;"
try:
    cursor = conn.cursor()
    cursor.execute(delete_Inscripciones)
    cursor.execute(delete_estudiante)
    conn.commit()
    print("5) El Estudiante fue eliminado correctamente.")
except sqlite3.OperationalError as e:
    print(f"Error al eliminar el Estudiante: {e}")

Nuevo curso insertado correctamente.
Nuevo Estudiante insertado correctamente.
Estudiante inscrito correctamente.
El curso se le actualizo el numero de creditos correctamente.
El Estudiante fue eliminado correctamente.

In [35]:
# df_1 = pd.read_sql_query("SELECT * FROM Estudiantes where nombre = 'Lionel' AND apellido = 'Messi'", conn)
# display(df_1)
# df_2 = pd.read_sql_query("SELECT * FROM Cursos where nombre_curso = 'Big Data & AI'", conn)
# display(df_2)
# df_3 = pd.read_sql_query("SELECT * FROM Estudiantes where id_estudiante = 10 ", conn)
# display(df_3)
# df_4 = pd.read_sql_query("SELECT * FROM Inscripciones where id_estudiante = 10 ", conn)
# display(df_4)
# df_5 = pd.read_sql_query("SELECT * FROM Profesores ", conn)
# display(df_5)

## üîç Secci√≥n 2: Consultas SQL (Analysis) - 6 Puntos

**6. M√©tricas Generales (Agregaci√≥n)**
Calcula y muestra:
* Cantidad total de estudiantes.
* Cantidad total de cursos ofertados.
* Promedio de cr√©ditos de los cursos.

**7. Auditor√≠a de Profesores (LEFT JOIN)**
Necesitamos ver la carga laboral completa.
* Lista **todos** los profesores (Nombre y Apellido) y el curso que dictan.
* **Condici√≥n:** Deben aparecer los profesores que **NO** tienen cursos asignados actualmente (valor NULL).

**8. Popularidad (GROUP BY)**
* Genera una lista con el `Nombre del Curso` y la **Cantidad de Estudiantes** inscritos en √©l.
* Ordena del m√°s popular al menos popular.

**9. Cursos Masivos (HAVING)**
* Basado en la consulta anterior, filtra para mostrar solo los cursos que tienen **m√°s de 20 estudiantes** inscritos.

**10. B√∫squeda Inteligente (Subconsulta)**
* Obt√©n el nombre y apellido de los estudiantes inscritos en el curso **"Bases de Datos"**.
* **Reto:** No uses el ID=1 directamente. Usa una subconsulta `(SELECT id_curso FROM Cursos WHERE nombre_curso = 'Bases de Datos')`.

**11. S√°bana de Notas (INNER JOIN M√∫ltiple)**
* Genera un reporte detallado que contenga:
    * Nombre Estudiante | Apellido Estudiante | Nombre Curso | Nota Final | Nombre Profesor

In [37]:
# Espacio para Consultas SQL
# 6. M√©tricas Generales (Agregaci√≥n)
# Calcula y muestra: * Cantidad total de estudiantes. * Cantidad total de cursos ofertados. * Promedio de cr√©ditos de los cursos.
print("6) Calcula y muestra: * Cantidad total de estudiantes. * Cantidad total de cursos ofertados. * Promedio de cr√©ditos de los cursos.")
conteos_agrpacion = """
                        with Conteos as (
                        SELECT 
                            e.id_estudiante AS estudiante_id,
                            e.nombre || ' ' || apellido AS estudiante,
                            c.id_curso AS curso_id,
                            c.nombre_curso AS curso,
                            c.creditos,
                            i.id_inscripcion
                        FROM Cursos c
                        INNER JOIN  Inscripciones i ON c.id_curso = i.id_curso 
                        INNER JOIN  Estudiantes e ON i.id_estudiante = e.id_estudiante
                        )  
                        SELECT
                        COUNT(DISTINCT curso_id) AS total_cursos,
                        COUNT(id_inscripcion) AS total_inscripciones,
                        AVG(creditos) AS promedio_creditos 
                        from conteos
                    """
df_conteos = pd.read_sql_query(conteos_agrpacion, conn)
display(df_conteos)

# 7. Auditor√≠a de Profesores (LEFT JOIN)
# Necesitamos ver la carga laboral completa. Lista profesores y el curso que dictan adicional si no  tienen asignado curso
print("7) Calcula y muestra:  Cantidad total de estudiantes.  Cantidad total de cursos ofertados.  Promedio de cr√©ditos de los cursos.")
auditoria_profesores = """
                            WITH Conteos AS (
                                SELECT 
                                    p.id_profesor AS profesor_id,
                                    p.nombre || ' ' || p.apellido AS Nombre_Profesor,
                                    c.id_curso AS curso_id,
                                    c.nombre_curso AS Nombre_curso,
                                    c.creditos
                                FROM Profesores p
                                LEFT JOIN Cursos c ON  c.id_profesor = p.id_profesor
                            )
                            SELECT 
                                Nombre_Profesor,
                                Nombre_curso,
                                COUNT(DISTINCT curso_id) AS total_cursos
                            FROM Conteos                            
                            GROUP BY Nombre_Profesor, Nombre_curso;                                        
                        """
df_profesores = pd.read_sql_query(auditoria_profesores, conn)
display(df_profesores)

# 8. Popularidad (GROUP BY) / Lista con el `Nombre del Curso` numero de Estudiantes  inscritos en √©l. Ordena del m√°s popular al menos popular
print("8) Lista de Cursos m√°s populares del mas al menos popular")
popularidad_cursos = """
                                    SELECT 
                                        c.nombre_curso AS Nombre_curso,
                                        COUNT(i.id_estudiante) AS total_estudiantes
                                    FROM Cursos c
                                    INNER JOIN Inscripciones i ON c.id_curso = i.id_curso 
                                    GROUP BY c.nombre_curso
                                    ORDER BY total_estudiantes DESC;                 ---COUNT(i.id_estudiante)                       
                        """
df_cursos_populares = pd.read_sql_query(popularidad_cursos, conn)
display(df_cursos_populares)

# 9. Cursos Masivos (HAVING), Los cursos con mas de 20 estiudiantes inscritos
print("9) Cursos con mas de 20 estudiantes inscritos")
cursos_masivos =  """
                                    SELECT 
                                        c.nombre_curso AS Nombre_curso,
                                        COUNT(i.id_estudiante) AS total_estudiantes
                                    FROM Cursos c
                                    INNER JOIN Inscripciones i ON c.id_curso = i.id_curso 
                                    GROUP BY c.nombre_curso
                                    HAVING total_estudiantes > 20
                                    ORDER BY total_estudiantes DESC;                 ---COUNT(i.id_estudiante)                       
                        """
df_cursos_masivos = pd.read_sql_query(cursos_masivos, conn)
display(df_cursos_masivos)

# 10. nombre y apellido de los estudiantes inscritos en el curso "Bases de Datos"
# No uses el ID=1 directamente. Usa una subconsulta `(SELECT id_curso FROM Cursos WHERE nombre_curso = 'Bases de Datos')`.
print("10) Nombre y apellido de los estudiantes inscritos en el curso 'Bases de Datos'")
curso_basedatos = 'Bases de Datos'
estudiantes_bases_datos = f"""
                             SELECT 
                                 e.nombre AS  Nombre_Estudiante,
                                 e.apellido AS Apellido_Estudiante
                             FROM Estudiantes e
                             INNER JOIN Inscripciones i ON e.id_estudiante = i.id_estudiante
                             WHERE i.id_curso = (SELECT id_curso FROM Cursos WHERE nombre_curso = '{curso_basedatos}');
                        """
df_estuduantes_basesDatos = pd.read_sql_query(estudiantes_bases_datos, conn)
display(df_estuduantes_basesDatos)

# 11. S√°bana de Notas (INNER JOIN M√∫ltiple)
# Generar los siguientes campos /  Nombre Estudiante | Apellido Estudiante | Nombre Curso | Nota Final | Nombre Profesor
print("11) S√°bana de Notas completa por estudiante curso y profesor")
S√°bana_de_Notas = """
                        SELECT 
                            e.nombre AS Nombre_Estudiante,
                            e.apellido AS Apellido_Estudiante,
                            c.nombre_curso AS Nombre_Curso,             
                            i.nota_final AS Nota_Final,
                            p.nombre || ' ' || p.apellido AS Nombre_Profesor
                        FROM Estudiantes e
                        INNER JOIN Inscripciones i ON e.id_estudiante = i.id_estudiante
                        INNER JOIN Cursos c ON i.id_curso = c.id_curso
                        INNER JOIN Profesores p ON c.id_profesor = p.id_profesor;
                    """
df_sabana_notas = pd.read_sql_query(S√°bana_de_Notas, conn)
display(df_sabana_notas)

6) Calcula y muestra: * Cantidad total de estudiantes. * Cantidad total de cursos ofertados. * Promedio de cr√©ditos de los cursos.

   total_cursos  total_inscripciones  promedio_creditos
0           101                 2024           2.738142

7) Calcula y muestra:  Cantidad total de estudiantes.  Cantidad total de cursos ofertados.  Promedio de cr√©ditos de los cursos.

    Nombre_Profesor           Nombre_curso  total_cursos
0          Ana Diaz              Ingl√©s II             1
1          Ana Diaz             Ingl√©s III             1
2          Ana Diaz  Programaci√≥n Aplicado             1
3       Ana Jimenez      Filosof√≠a General             1
4       Ana Jimenez           Historia III             1
..              ...                    ...           ...
103  Valeria Pineda    Estad√≠stica Te√≥rico             1
104  Valeria Zainea        Derecho Te√≥rico             1
105  Valeria Zainea       Filosof√≠a B√°sico             1
106  Valeria Zainea         √Ålgebra B√°sico             1
107  Valeria Zainea        √Ålgebra General             1

[108 rows x 3 columns]

8) Lista de Cursos m√°s populares del mas al menos popular

         Nombre_curso  total_estudiantes
0   Econom√≠a Avanzado                103
1      √âtica Avanzado                 83
2      Bases de Datos                 70
3     Ingl√©s Avanzado                 62
4          Ingl√©s III                 61
..                ...                ...
59  Historia Avanzado                 14
60      Estad√≠stica I                 13
61             Arte I                 13
62    F√≠sica Avanzado                 12
63      Big Data & AI                  1

[64 rows x 2 columns]

9) Cursos con mas de 20 estudiantes inscritos

             Nombre_curso  total_estudiantes
0       Econom√≠a Avanzado                103
1          √âtica Avanzado                 83
2          Bases de Datos                 70
3         Ingl√©s Avanzado                 62
4              Ingl√©s III                 61
5            Historia III                 60
6        Derecho Avanzado                 60
7              Biolog√≠a I                 60
8     Estad√≠stica Te√≥rico                 46
9      Sociolog√≠a Te√≥rico                 43
10           √âtica B√°sico                 42
11  Programaci√≥n Aplicado                 42
12              √âtica III                 41
13             Qu√≠mica II                 41
14     Filosof√≠a Aplicado                 41
15       √Ålgebra Avanzado                 40
16        C√°lculo Te√≥rico                 39
17         Qu√≠mica B√°sico                 37
18   Estad√≠stica Aplicado                 37
19              C√°lculo I                 37
20      Filosof√≠a General                 36
21    Programaci√≥n B√°sico                 35
22        Econom√≠a B√°sico                 35
23           Biolog√≠a III                 35
24              Qu√≠mica I                 34
25        √Ålgebra General                 30
26         F√≠sica Te√≥rico                 30
27     Estad√≠stica B√°sico                 30
28         √Ålgebra B√°sico                 28
29           Arte General                 27
30         Sociolog√≠a III                 26
31      Sociolog√≠a B√°sico                 26
32       Programaci√≥n III                 26
33         Ingl√©s Te√≥rico                 26
34       Filosof√≠a B√°sico                 25
35    Estad√≠stica General                 25
36       Biolog√≠a General                 25
37                Arte II                 24
38        Derecho Te√≥rico                 23
39            Biolog√≠a II                 23
40   Programaci√≥n Te√≥rico                 22
41   Estad√≠stica Avanzado                 22
42      Biolog√≠a Avanzado                 22
43              Ingl√©s II                 21
44         F√≠sica General                 21
45      Econom√≠a Aplicado                 21
46          Arte Aplicado                 21

10) Nombre y apellido de los estudiantes inscritos en el curso 'Bases de Datos'

   Nombre_Estudiante Apellido_Estudiante
0              Diego            Martinez
1              Lucia              Zainea
2              Oscar                Mora
3           Fernando              Zainea
4            Valeria                Maya
..               ...                 ...
65             David            Martinez
66           Nicolas                Mora
67            Hector              Ortega
68            Hector            Martinez
69           Ricardo              Ortega

[70 rows x 2 columns]

11) S√°bana de Notas completa por estudiante curso y profesor

,Nombre_Estudiante,Apellido_Estudiante,Nombre_Curso,Nota_Final,Nombre_Profesor
0,Esteban,Perez,Bases de Datos,3.09,Andres Rios
1,Mateo,Pineda,Bases de Datos,4.43,Andres Rios
2,Elena,Navarro,Bases de Datos,4.72,Andres Rios
3,Sofia,Mendoza,Bases de Datos,2.93,Andres Rios
4,Elena,Gutierrez,Bases de Datos,3.52,Andres Rios
...,...,...,...,...,...
2019,David,Ruiz,Ingl√©s Avanzado,4.94,Kevin Navarro
2020,David,Ruiz,Econom√≠a B√°sico,3.08,Marta Maya
2021,David,Ruiz,√âtica III,2.62,Andres Rios
2022,David,Ruiz,Ingl√©s Avanzado,0.15,Camila Martinez
2023,Lionel,Messi,Big Data & AI,2.25,Camila Martinez

UPDATE TABLA INSCRIPCIONES 
COLUMNA DE NOTAS

In [43]:
# ACTIVIDADES ADICIONALES (Opcional)
nuevo_Inscripciones = "update Inscripciones set nota_final = ABS(ROUND(1 + (RANDOM() / 9223372036854775807.0) * 4, 2))"
try:
    cursor = conn.cursor()
    cursor.execute(nuevo_Inscripciones)
    conn.commit()
    print("Update ejecutado correctamente")
except sqlite3.OperationalError as e:
    print(f"Error al al ejecutar el UPDATE: {e}")

Update ejecutado correctamente

In [44]:
validar_notas = """    
                   SELECT *  from Inscripciones where id_inscripcion between 1 and 100	;     
                    """
df_vallidar_notas = pd.read_sql_query(validar_notas, conn)
display(df_vallidar_notas)

    id_inscripcion  id_estudiante  id_curso fecha_inscripcion  nota_final
0                1             69         1        2024-02-01        3.09
1                2            298         1        2024-02-01        4.43
2                3            364         1        2024-02-01        4.72
3                4            116         1        2024-02-01        2.93
4                5            261         1        2024-02-01        3.52
..             ...            ...       ...               ...         ...
91              96             12        24        2024-02-01        4.46
92              97             12        46        2024-02-01        0.92
93              98             12        51        2024-02-01        1.37
94              99             13        74        2024-02-01        4.52
95             100             13        66        2024-02-01        0.07

[96 rows x 5 columns]

## üìä Secci√≥n 3: Anal√≠tica con Python (Pandas) - 4 Puntos

**12. Carga de Datos**
* Ejecuta la consulta del punto 11 (S√°bana de Notas) y gu√°rdala en un DataFrame llamado `df_notas`.
* Muestra las primeras 5 filas y usa `.info()` para verificar tipos de datos.

**13. An√°lisis de Riesgo**
* Filtra el DataFrame `df_notas` para encontrar a los estudiantes que van perdiendo (Nota < 3.0).
* Gu√°rdalos en un nuevo DF `df_riesgo` y cuenta cu√°ntos son.

**14. Tabla Pivote (Cruce de Variables)**
* Crea una tabla din√°mica que muestre el **Promedio de Notas** (values) organizados por `Nombre Curso` (index) y `Nombre Profesor` (columns).

**15. Visualizaci√≥n (Gr√°fico)**
* Usando el DataFrame `df_notas`, crea un histograma o un gr√°fico de barras que muestre la distribuci√≥n de las notas finales.
* *Opcional:* Un gr√°fico de barras con el Top 5 de cursos con m√°s estudiantes.

In [ ]:
# Espacio para Python / Pandas
# 12. Consulta del punto 11 (S√°bana de Notas)
print("12) Consulta S√°bana de Notas, solo 5 registros y el esquema")
sql_notas = """
                        SELECT 
                            e.nombre AS Nombre_Estudiante,
                            e.apellido AS Apellido_Estudiante,
                            c.nombre_curso AS Nombre_Curso,             
                            i.nota_final AS Nota_Final,
                            p.nombre || ' ' || p.apellido AS Nombre_Profesor
                        FROM Estudiantes e
                        INNER JOIN Inscripciones i ON e.id_estudiante = i.id_estudiante
                        INNER JOIN Cursos c ON i.id_curso = c.id_curso
                        INNER JOIN Profesores p ON c.id_profesor = p.id_profesor
                        
"""
df_notas = pd.read_sql_query(sql_notas, conn)
display(df_notas.head(5)) 
df_notas.info()

# 13.
# 14.
# 15.







# conn.close()
# print("¬°Examen Finalizado!")

12) Consulta S√°bana de Notas, solo 5 registros y el esquema

,Nombre_Estudiante,Apellido_Estudiante,Nombre_Curso,Nota_Final,Nombre_Profesor
0,Esteban,Perez,Bases de Datos,None,Andres Rios
1,Mateo,Pineda,Bases de Datos,None,Andres Rios
2,Elena,Navarro,Bases de Datos,None,Andres Rios
3,Sofia,Mendoza,Bases de Datos,None,Andres Rios
4,Elena,Gutierrez,Bases de Datos,None,Andres Rios

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2024 entries, 0 to 2023
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Nombre_Estudiante    2024 non-null   object
 1   Apellido_Estudiante  2024 non-null   object
 2   Nombre_Curso         2024 non-null   object
 3   Nota_Final           0 non-null      object
 4   Nombre_Profesor      2024 non-null   object
dtypes: object(5)
memory usage: 79.2+ KB